In [3]:
#accesssing the data from the dataframe
import pandas as pd
s=pd.read_csv("C:\\Users\\prash\\OneDrive\\Desktop\\Pandas\\examdet.csv")
print(s)

    htno     name  telugu  english  hindi  maths  science  social
0    100   Ramesh      50       60     66     98       66      55
1    101   Rajesh      45       67     34     67       66      78
2    102   Rossum      56       88     56     99       44      77
3    103     Raji      56       78     34     56       88      55
4    104   Kalyan      51       63     62     93       67      51
5    105  Karthik      48       62     39     68       65      88
6    106   Kambli      53       81     59     92       48      73
7    107  Praveen      46       88     74     86       78      45
8    108   Ganesh      53       62     76     88       76      35
9    109     Nags      55       77     44     77       86      58
10   110    Biswa      66       48     86     95       48      47
11   111   Ritchi      66       68     64     76       98      75
12   104   Kalyan      51       63     62     93       67      51
13   112  shareef      50       63     99     90       76      67
14   113     sonu      60       89     98     87       77      68
15   114   Rajesh      45       67     77     55       66      46
16   115   Rakesh      67       78     88     78       67      49

In [7]:
df=s.head(10)
print(df)#we will get first 10 head of data

   htno     name  telugu  english  hindi  maths  science  social
0   100   Ramesh      50       60     66     98       66      55
1   101   Rajesh      45       67     34     67       66      78
2   102   Rossum      56       88     56     99       44      77
3   103     Raji      56       78     34     56       88      55
4   104   Kalyan      51       63     62     93       67      51
5   105  Karthik      48       62     39     68       65      88
6   106   Kambli      53       81     59     92       48      73
7   107  Praveen      46       88     74     86       78      45
8   108   Ganesh      53       62     76     88       76      35
9   109     Nags      55       77     44     77       86      58

In [9]:
df=s.tail(10)
print(df)#we will get last 10 end of data

    htno     name  telugu  english  hindi  maths  science  social
7    107  Praveen      46       88     74     86       78      45
8    108   Ganesh      53       62     76     88       76      35
9    109     Nags      55       77     44     77       86      58
10   110    Biswa      66       48     86     95       48      47
11   111   Ritchi      66       68     64     76       98      75
12   104   Kalyan      51       63     62     93       67      51
13   112  shareef      50       63     99     90       76      67
14   113     sonu      60       89     98     87       77      68
15   114   Rajesh      45       67     77     55       66      46
16   115   Rakesh      67       78     88     78       67      49

In [19]:
df=s.describe(include="all")
print(df)#we will get 10 first head of data

              htno    name     telugu    english      hindi      maths  \
count    17.000000      17  17.000000  17.000000  17.000000  17.000000
unique         NaN      15        NaN        NaN        NaN        NaN
top            NaN  Rajesh        NaN        NaN        NaN        NaN
freq           NaN       2        NaN        NaN        NaN        NaN
mean    107.294118     NaN  54.000000  70.705882  65.764706  82.235294
std       4.687279     NaN   7.141428  11.671358  20.504662  13.917298
min     100.000000     NaN  45.000000  48.000000  34.000000  55.000000
25%     104.000000     NaN  50.000000  63.000000  56.000000  76.000000
50%     107.000000     NaN  53.000000  67.000000  64.000000  87.000000
75%     111.000000     NaN  56.000000  78.000000  77.000000  93.000000
max     115.000000     NaN  67.000000  89.000000  99.000000  99.000000

          science     social
count   17.000000  17.000000
unique        NaN        NaN
top           NaN        NaN
freq          NaN        NaN
mean    69.588235  59.882353
std     14.339887  14.696438
min     44.000000  35.000000
25%     66.000000  49.000000
50%     67.000000  55.000000
75%     77.000000  73.000000
max     98.000000  88.000000

In [41]:
df=s["name"].describe()
print(df)

count         17
unique        15
top       Rajesh
freq           2
Name: name, dtype: object

In [51]:
df=s.iterrows()
print(df)
for val in s.iterrows():
    print(val)

<generator object DataFrame.iterrows at 0x000001E7305009D0>
(0, htno          100
name       Ramesh
telugu         50
english        60
hindi          66
maths          98
science        66
social         55
Name: 0, dtype: object)
(1, htno          101
name       Rajesh
telugu         45
english        67
hindi          34
maths          67
science        66
social         78
Name: 1, dtype: object)
(2, htno          102
name       Rossum
telugu         56
english        88
hindi          56
maths          99
science        44
social         77
Name: 2, dtype: object)
(3, htno        103
name       Raji
telugu       56
english      78
hindi        34
maths        56
science      88
social       55
Name: 3, dtype: object)
(4, htno          104
name       Kalyan
telugu         51
english        63
hindi          62
maths          93
science        67
social         51
Name: 4, dtype: object)
(5, htno           105
name       Karthik
telugu          48
english         62
hindi           39
maths           68
science         65
social          88
Name: 5, dtype: object)
(6, htno          106
name       Kambli
telugu         53
english        81
hindi          59
maths          92
science        48
social         73
Name: 6, dtype: object)
(7, htno           107
name       Praveen
telugu          46
english         88
hindi           74
maths           86
science         78
social          45
Name: 7, dtype: object)
(8, htno          108
name       Ganesh
telugu         53
english        62
hindi          76
maths          88
science        76
social         35
Name: 8, dtype: object)
(9, htno        109
name       Nags
telugu       55
english      77
hindi        44
maths        77
science      86
social       58
Name: 9, dtype: object)
(10, htno         110
name       Biswa
telugu        66
english       48
hindi         86
maths         95
science       48
social        47
Name: 10, dtype: object)
(11, htno          111
name       Ritchi
telugu         66
english        68
hindi          64
maths          76
science        98
social         75
Name: 11, dtype: object)
(12, htno          104
name       Kalyan
telugu         51
english        63
hindi          62
maths          93
science        67
social         51
Name: 12, dtype: object)
(13, htno           112
name       shareef
telugu          50
english         63
hindi           99
maths           90
science         76
social          67
Name: 13, dtype: object)
(14, htno        113
name       sonu
telugu       60
english      89
hindi        98
maths        87
science      77
social       68
Name: 14, dtype: object)
(15, htno          114
name       Rajesh
telugu         45
english        67
hindi          77
maths          55
science        66
social         46
Name: 15, dtype: object)
(16, htno          115
name       Rakesh
telugu         67
english        78
hindi          88
maths          78
science        67
social         49
Name: 16, dtype: object)

In [63]:
df=s[1:4:2][["name","telugu"]]
print(df)

     name  telugu
1  Rajesh      45
3    Raji      56

In [65]:
df=s[1:4][["name","telugu"]]
print(df)

     name  telugu
1  Rajesh      45
2  Rossum      56
3    Raji      56